import React from "react";
import EachCommentBoxItem from "../../../Components/EachCommentBoxItem";
import Masonry from "react-masonry-css";

export default function CommentsSection() {
  const commentData = [
    {
      name: "محمد محمدی",
      workArea: "لیدر کوهنوردی آژانس مهاپرواز ",
      comment: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
    },
    {
      name: "محمد محمدی",
      workArea: "لیدر کوهنوردی آژانس مهاپرواز ",
      comment:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت...",
    },
    {
      name: "محمد محمدی",
      workArea: "لیدر کوهنوردی آژانس مهاپرواز ",
      comment: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
    },
    {
      name: "محمد محمدی",
      workArea: "لیدر کوهنوردی آژانس مهاپرواز ",
      comment:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است لورم ایپسوم",
    },
    {
      name: "محمد محمدی",
      workArea: "لیدر کوهنوردی آژانس مهاپرواز ",
      comment:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت...",
    },
    {
      name: "محمد محمدی",
      workArea: "لیدر کوهنوردی آژانس مهاپرواز ",
      comment:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است لورم ایپسوم",
    },
    {
      name: "محمد محمدی",
      workArea: "لیدر کوهنوردی آژانس مهاپرواز ",
      comment:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت...",
    },
    {
      name: "محمد محمدی",
      workArea: "لیدر کوهنوردی آژانس مهاپرواز ",
      comment: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
    },
    {
      name: "محمد محمدی",
      workArea: "لیدر کوهنوردی آژانس مهاپرواز ",
      comment:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است لورم ایپسوم",
    },
    {
      name: "محمد محمدی",
      workArea: "لیدر کوهنوردی آژانس مهاپرواز ",
      comment:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت...",
    },
    {
      name: "محمد محمدی",
      workArea: "لیدر کوهنوردی آژانس مهاپرواز ",
      comment: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
    },
    {
      name: "محمد محمدی",
      workArea: "لیدر کوهنوردی آژانس مهاپرواز ",
      comment:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است لورم ایپسوم",
    },
    {
      name: "محمد محمدی",
      workArea: "لیدر کوهنوردی آژانس مهاپرواز ",
      comment:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت...",
    },
    {
      name: "محمد محمدی",
      workArea: "لیدر کوهنوردی آژانس مهاپرواز ",
      comment: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ",
    },
    {
      name: "محمد محمدی",
      workArea: "لیدر کوهنوردی آژانس مهاپرواز ",
      comment:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است لورم ایپسوم",
    },
  ];

  const breakpointColumnsObj = {
    default: 5,
    1240: 4,
    1023: 3,
    768: 2,
    640: 1,
  };

  return (
    <div className="container mx-auto flex flex-col items-center py-24 gap-12">
      <h2 className="text-3xl text-Titles">نظرات کاربران</h2>
      <div className="w-full flex flex-col items-center overflow-hidden">
        <div className="w-full flex h-[650px] overflow-hidden sm:px-0 px-3">
          <Masonry
            breakpointCols={breakpointColumnsObj}
            className="flex gap-3 w-full"
          >
            {commentData.map((item, index) => (
              <EachCommentBoxItem
                key={index}
                name={item.name}
                workArea={item.workArea}
                comment={item.comment}
              />
            ))}
          </Masonry>
        </div>
        <span className="w-full h-2 shadow-[0_0px_190px_260px_rgba(255,255,255,1)]"></span>
      </div>
      <span className="text-Secoundray font-bold translate-y-[-13rem]">
        و 120+ نفر دیگر
      </span>
    </div>
  );
}
